enum salawat { sobo7, dohor, aser, ma8reb, esha }

var ta3kebatinarabic = {
  salawat.sobo7: "تعقيب صلاة الصبح",
  salawat.dohor: "تعقيب صلاة الظهر",
  salawat.aser: "تعقيب صلاة العصر",
  salawat.ma8reb: "تعقيب صلاة المغرب",
  salawat.esha: "تعقيب صلاة العشاء",
};
const ta3k3bat = {
  salawat.sobo7:
      "اللهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاهدِني لِما اختُلِفَ فيهِ مِنَ الحَقِّ بِإذنِكَ، إنَّكَ تَهدي مَن تَشاءُ إلى صِراطٍ مُستَقيمٍ\n\nوتقول عشر مرّات: اللهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ الأوصياءِ الرَّاضينَ المَرضيّينَ بِأفضَلِ صَلَواتِـكَ، وَبارك عَلَيهِم بِأفضَلِ بَرَكاتِكَ، وَالسَّلامُ عَلَيهِم وَعَلى أرواحِهِم وَأجسادِهِم وَرَحمَةُ اللهِ وَبَرَكاتُهُ.",
  salawat.dohor:
      "لا إلهَ إلاّ اللهُ العَظيمُ الحَليمُ، لا إلهَ إلاّ الله رَبُّ العَرشِ الكَريمُ، الحَمدُ للهِ رَبِّ العالَمينَ. اللهُمَّ إنّي أسألُكَ مُوجِباتِ رَحمَتِكَ وَعَزائِمَ مَغفِرَتِكَ، وَالغَنيمَةَ مِن كُلِّ بِرٍّ، وَالسَّلامَةَ مِن كُلِّ إثمٍ. اللهُمَّ لا تَدَع لي ذَنباً إلاّ غَفَرتَهُ، وَلا هَمّاً إلاّ فَرَّجتَهُ، وَلا سُقماً إلاّ شَفَيتَهُ، وَلا عَيباً إلاّ سَتَرتَهُ، وَلا رِزقاً إلاّ بَسَطتَهُ، وَلا خَوفاً إلاّ آمَنتَهُ، وَلا سوءاً إلاّ صَرَفتَهُ، وَلا حاجَةً هيَ لَكَ رِضاً وَليَ فيها صَلاحٌ إلاّ قَضَيتَها؛ يا أرحَمَ الرَّاحِمينَ آمينَ رَبَّ العالَمينَ.\n\nوَتَقول عشر مَرات: بِاللهِ اعتَصَمتُ وَبِالله أثِقُ وَعَلى الله أتَوَكَّلُ.\n\nثمّ تقول: اللهُمَّ إن عَظُمَت ذُنوبي فَأنتَ أعظَمُ، وَإن كَبُرَ تَفريطي فَأنتَ أكبَرُ، وَإن دامَ بُخلي فَأنتَ أجوَدُ، اللهُمَّ اغفِر لي عَظيمَ ذُنوبي بِعَظيمِ عَفوِكَ، وَكَثيرَ تَفريطي بِظاهِرِ كَرَمِكَ، وَاقمَع بُخلي بِفَضلِ جودِكَ. اللهُمَّ ما بِنا مِن نِعمَةٍ فَمِنكَ لا إلهَ إلاّ أنتَ. أستَغفِرُكَ وَأتوبُ إلَيكَ.",
  salawat.aser:
      "أستَغفِرُ اللهَ الَّذي لا إلهَ إلاّ هُوَ الحَيُّ القَيّومُ الرَّحمنُ الرَّحيمُ ذو الجَلالِ وَالإكرامِ، وَأسألُهُ أن يَتوبَ عَلَيَّ تَوبَةَ عَبدٍ ذَليلٍ خاضِعٍ فَقيرٍ بائِسٍ مِسكينٍ مُستَكينٍ مُستَجيرٍ، لا يملك لِنَفسِهِ نَفعاً وَلا ضَرّاً وَلا مَوتاً وَلا حياةً وَلا نُشوراً.\n\nثمّ تقول: اللهُمَّ إنّي أعوذُ بِكَ مِن نَفسٍ لا تَشبَعُ، وَمِن قَلبٍ لا يَخشَعُ، وَمِن عِلمٍ لا يَنفَعُ، وَمِن صَلاةٍ لا تُرفَعُ، وَمِن دُعاءٍ لا يُسمَعُ.\n\nاللهُمَّ إنّي أسألُكَ اليُسرَ بَعدَ العُسرِ وَالفَرَجَ بَعدَ الكَربِ وَالرَّخاءَ بَعدَ الشِّدَّةِ.\n\nاللَّهُمَّ ما بِنا مِن نِعمَةٍ فَمِنكَ لا إلهَ إلاّ أنتَ. أستَغفِرُكَ وَأتوبُ إلَيكَ.",
  salawat.ma8reb:
      "تقول بَعدَ تسبيح الزهراء (عليها السلام): إنَّ اللهَ وَمَلائِكَتَهُ يُصَلّونَ عَلى النَّبيِّ، يا أيُّها الَّذينَ آمَنوا صَلّوا عَلَيهِ وَسَلِّموا تَسليماً. اللهُمَّ صَلِّ عَلى مُحَمَّدٍ النَّبيِّ وَعَلى ذُرّيَّتِهِ وَعَلى أهلِ بَيتِهِ.\n\nثُمَّ تقول سَبع مَرات: بِسمِ اللهِ الرَّحمنِ الرَّحيمِ وَلا حَول وَلا قوَّةَ إلاّ بِالله العَليِّ العَظيمِ.\n\nوثلاثاً: الحَمدُ للهِ الَّذي يَفعَلُ ما يَشاءُ وَلا يَفعَلُ ما يَشاءُ غَيرُه.\n\nثمّ قل: سُبحانَكَ لا إلهَ إلاّ أنتَ اغفِر لي ذُنوبي كُلَّها جَميعاً، فَإنَّهُ لا يَغفِرُ الذُّنوبَ كُلَّها جَميعاً إلاّ أنتَ.",
  salawat.esha:
      "اللهُمَّ إنَّهُ لَيسَ لي عِلمٌ بِمَوضِعِ رِزقي وَإنَّما أطلُبُهُ بِخَطَراتٍ تَخطُرُ عَلى قَلبي، فَأجولُ في طَلَبِهِ البُلدانَ، فَأنا فيما أنا طالِبٌ كَالحَيرانِ، لا أدري أفي سَهلٍ هوَ، أم في جَبَلٍ، أم في أرضٍ، أم في سَماءٍ، أم في بَرٍّ أم في بَحرٍ ؟ وَعَلى يَدَي مَن، وَمِن قِبَلِ مَن؟ وَقَد عَلِمتُ أنَّ عِلمَهُ عِندَكَ وَأسبابَهُ بيَدِكَ، وَأنتَ الَّذي تَقسِمُهُ بِلُطفِكَ، وَتُسَبِّبُهُ بِرَحمَتِكَ. اللهُمَّ فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ، وَاجعَل يا رَبِّ رِزقَكَ لي وَاسِعاً وَمَطلَبَهُ سَهلاً وَمَأخَذَهُ قَريباً، وَلا تُعَـنِّـني بِطَلَبِ ما لَم تُقَدِّر لي فيهِ رِزقاً، فَإنَّكَ غَنيُّ عَن عَذابي وَأنا فَقيرٌ إلى رَحمَتِكَ، فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَجُد عَلى عَبدِكَ بِفَضلِكَ، إنَّكَ ذو فَضلٍ عَظيمٍ."
}; // write all ta3kebat of each salat :)
const optional_ta3kebat = {
  salawat.sobo7: "",
  salawat.dohor: "",
  salawat.aser:
      "وعَن الصادق (عليه السلام) قالَ: مَن اَستَغفر الله تعالى بَعدَ صلاة العصر سَبعين مرَّةً غفر الله لَهُ سبعمائة ذنب. وروي عَن الإمام محمد الباقر(عليه السلام) قالَ: مَن قرأ (إنّا أنزَلناهُ في لَيلَةِ القَدرِ) بَعدَ العصر عشر مَرات، مرت لَهُ على مثل اعمال الخلائق في ذلك اليوم.\n\nوَيُستحب دعاء العشرات في كُلّ صباحٍ ومَساء، وأفضلُ أوقاته بعد العصر يوم الجمعة وسيأتي الدعاء فيما بعد.",
  salawat.ma8reb: "",
  salawat.esha: ""
};//optional and beneficial ta3kebat after prayer :)